Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Methods
The LineTypeAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
LineTypeAttributes Class
Tekla.Structures.Drawing Namespace